app/controllers/letters_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        user = User.find_by(id: session[:user_id])

INSERT INTO "letters" ("letter_title", "recipient", "company", "job_title", "variable1", "variable2", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        letter = Letter.create(letter_params)

SELECT "letters".* FROM "letters" WHERE "letters"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "letter_blocks" WHERE "letter_blocks"."id" = $1  [["id", 19]]
UPDATE "letters" SET "letter_title" = $1, "updated_at" = $2 WHERE "letters"."id" = $3  [["letter_title", "My Demo Letter"], ["updated_at", "2022-09-30 14:49:15.775346"], ["id", 27]]
---
    def update
        letter = Letter.find_by(id: params[:id])
        letter.letter_blocks.destroy_all
        letter.update(letter_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "letters".* FROM "letters" WHERE "letters"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "letters" WHERE "letters"."id" = $1  [["id", 26]]
---
    def destroy
        user = User.find_by(id: session[:user_id])
        letter = Letter.find(params[:id])
        if user
          letter.destroy