app/controllers/letter_blocks_controller.rb

    def create
        join = LetterBlock.create(letter_block_params)
---
INSERT INTO "letter_blocks" ("letter_id", "prose_block_id", "created_at", "updated_at", "position") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["letter_id", 12], ["prose_block_id", 3], ["created_at", "2022-09-27 23:17:44.522757"], ["updated_at", "2022-09-27 23:17:44.522757"], ["position", 3]]