app/controllers/prose_blocks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def show
        user = User.find_by(id: session[:user_id])

SELECT "prose_blocks".* FROM "prose_blocks" WHERE "prose_blocks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "prose_blocks" SET "block_title" = $1, "updated_at" = $2 WHERE "prose_blocks"."id" = $3  [["block_title", "My Greeting 1"], ["updated_at", "2022-09-30 13:45:50.021679"], ["id", 16]]
---
    def update
        prose = ProseBlock.find_by(id: params[:id])
        prose.update(prose_block_params)

INSERT INTO "prose_blocks" ("block_title", "block_type", "prose_content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["block_title", "My New Prose Block"], ["block_type", ""], ["prose_content", ""], ["user_id", 9], ["created_at", "2022-09-30 13:47:32.937213"], ["updated_at", "2022-09-30 13:47:32.937213"]]
---
    def create
        prose = ProseBlock.create(prose_block_params)

SELECT "prose_blocks".* FROM "prose_blocks" WHERE "prose_blocks"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "prose_blocks" WHERE "prose_blocks"."id" = $1  [["id", 19]]
---
    def destroy
        prose = ProseBlock.find(params[:id])
        if prose
          prose.destroy