app/controllers/users_controller.rb

    def show
      user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      user = User.create(user_params)

      if user.valid?
        session[:user_id] = user.id
        Letter.create(letter_title: "My First Letter", recipient: "", company: "", job_title: "", variable1: "", variable2: "", user: user )
        ProseBlock.create(block_title: "Blank Greeting", block_type: "greeting", prose_content: "", user: user)
        ProseBlock.create(block_title: "Blank Body", block_type: "body", prose_content: "", user: user)
        ProseBlock.create(block_title: "Blank Closing", block_type: "closing", prose_content: "", user: user )
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Frodo"], ["password_digest", "[FILTERED]"], ["created_at", "2022-09-22 19:48:35.004666"], ["updated_at", "2022-09-22 19:48:35.004666"]]
INSERT INTO "letters" ("letter_title", "recipient", "company", "job_title", "variable1", "variable2", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "prose_blocks" ("block_title", "block_type", "prose_content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["block_title", "Blank Greeting"], ["block_type", "greeting"], ["prose_content", ""], ["user_id", 7], ["created_at", "2022-09-29 14:25:44.886651"], ["updated_at", "2022-09-29 14:25:44.886651"]]
INSERT INTO "prose_blocks" ("block_title", "block_type", "prose_content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["block_title", "Blank Body"], ["block_type", "body"], ["prose_content", ""], ["user_id", 7], ["created_at", "2022-09-29 14:25:44.893849"], ["updated_at", "2022-09-29 14:25:44.893849"]]
INSERT INTO "prose_blocks" ("block_title", "block_type", "prose_content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["block_title", "Blank Closing"], ["block_type", "closing"], ["prose_content", ""], ["user_id", 7], ["created_at", "2022-09-29 14:25:44.898837"], ["updated_at", "2022-09-29 14:25:44.898837"]]